In [31]:
import pandas as pd
from sklearn import linear_model
from word2number import w2n
import numpy as np

In [21]:
!pip install word2number

Requirement already satisfied: word2number in e:\falansh\applications\new folder\lib\site-packages (1.1)
Could not build wheels for word2number, since package 'wheel' is not installed.

In [22]:
reg = linear_model.LinearRegression()

In [23]:
df = pd.read_csv('hiring.csv')
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0        NaN                    8.0                           9      50000
1        NaN                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [24]:
df.experience = df.experience.fillna('zero')
df.head()

  experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       zero                    8.0                           9      50000
1       zero                    8.0                           6      45000
2       five                    6.0                           7      60000
3        two                   10.0                          10      65000
4      seven                    9.0                           6      70000

In [30]:
df.isnull()

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0       False                  False                       False      False
1       False                  False                       False      False
2       False                  False                       False      False
3       False                  False                       False      False
4       False                  False                       False      False
5       False                  False                       False      False
6       False                   True                       False      False
7       False                  False                       False      False

In [46]:
x1 = np.mean(df[['test_score(out of 10)']])
df[['test_score(out of 10)']] = df[['test_score(out of 10)']].fillna(x1)
df[['test_score(out of 10)']] = df[['test_score(out of 10)']].astype(int)

In [25]:
df.experience = df.experience.apply(w2n.word_to_num)

In [47]:
df

   experience  test_score(out of 10)  interview_score(out of 10)  salary($)
0           0                      8                           9      50000
1           0                      8                           6      45000
2           5                      6                           7      60000
3           2                     10                          10      65000
4           7                      9                           6      70000
5           3                      7                          10      62000
6          10                      7                           7      72000
7          11                      7                           8      80000

In [43]:
x = df.drop('salary($)', axis = 1)
y = df['salary($)']

In [48]:
reg.fit(x, y)

LinearRegression(copy_X=True, fit_intercept=True, n_jobs=None, normalize=False)

In [49]:
query = [[2, 9, 6], [12, 10, 10]]
reg.predict(query)

array([53290.89255945, 92268.07227784])